(function(){
var Fulltohalf = (function (){
	var han = "0123456789.,-+ABCDEFGHIJKLMNOPQRSTUVWXYZｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜｦﾝｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜｦﾝｧｧｨｨｩｩｪｪｫｫｯｯｬｬｭｭｮｮｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾊﾋﾌﾍﾎﾊﾋﾌﾍﾎｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾊﾋﾌﾍﾎﾊﾋﾌﾍﾎｳ";
	var zen = "０１２３４５６７８９．，－＋ＡＢＣＤＥＦＪＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺアイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲンあいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをんぁァぃィぅゥぇェぉォっッゃャゅュょョがぎぐげござじずぜぞだぢづでどばびぶべぼぱぴぷぺぽガギグゲゴザジズゼゾダジヅデドバビブベボパピプペポヴ";
	return function (strVal) {
		for (var i=0,str = "",m=strVal.length,c = "",n=0; i<m; i++){
			c = strVal.charAt(i),n = zen.indexOf(c,0);
			str += (n >= 0) ? han.charAt(n) : "ﾞ" + c;
		}
		return str;
	}
})();
SkillForm.setDecoList([
["天刻印",[
"2CB3", //斬れ味UPの印
"2CB4", //スキルUPの印
"2CB5", //攻撃力UPの印
"2CB6", //属性・状態UPの印
"2CB7", //距離補正の印
"2CB8", //強撃ビンUPの印
"2CB9", //防御力UPの印
"2CBA", //ダメージ軽減の印
"2CBB", //体力自動回復の印
"2CBC" //Ｇ級防具の印
]],["天封印",[
"17BA", //[片手]真空回転斬
"17BB", //[双剣]刃打術
"17BC", //[大剣]薙ぎ払い
"17BD", //[大剣]ガード斬Ⅰ
"17BE", //[大剣]ガード斬Ⅱ
"17BF", //[太刀]貫刺し
"17C0", //[銃槍]踏込斬上げ
"17C1", //[鎚]溜移動術Ⅰ
"17C2", //[鎚]溜移動術Ⅱ
"17C3", //[鎚]溜移動術Ⅲ
"17C4", //スタン値の印
"17C5", //音爆範囲拡大の印
"2B04", //火属性の印
"2B05", //水属性の印
"2B06", //雷属性の印
"2B07", //龍属性の印
"2B08", //氷属性の印
"2B09", //麻痺属性の印
"2B0A", //睡眠属性の印
"2B0B", //毒属性の印
"2B0C", //会心の印
"2B0D", //通常弾の印Ⅰ
"2B0E", //貫通弾の印Ⅰ
"2B0F", //散弾の印Ⅰ
"2B10", //徹甲榴弾の印Ⅰ
"2B11", //火炎弾の印Ⅰ
"2B12", //水冷弾の印Ⅰ
"2B13", //電撃弾の印Ⅰ
"2B14", //氷結弾の印Ⅰ
"2B15", //通常弾の印Ⅱ
"2B16", //貫通弾の印Ⅱ
"2B17", //散弾の印Ⅱ
"2B18", //徹甲榴弾の印Ⅱ
"2B19", //火炎弾の印Ⅱ
"2B1A", //水冷弾の印Ⅱ
"2B1B", //電撃弾の印Ⅱ
"2B1C", //氷結弾の印Ⅱ
"3918", //スキル枠の印
"3919", //閃転強化の印
"391A", //巧撃強化の印
"391B", //属撃強化の印
"391C", //纏雷強化の印
"391D", //氷界強化の印
"391E", //吸血強化の印
"391F", //劇物強化の印
"3920", //支援強化の印
"3921", //耳栓強化の印
"3922", //風圧強化の印
"3923", //耐震強化の印
"3924", //耐毒強化の印
"3925", //耐麻強化の印
"3926", //耐睡強化の印
"3927", //節約強化の印
"3928", //ガ性強化の印
"3929", //適応強化の印
"392A", //鼓舞強化の印
"392B", //反射強化の印
"392C", //巧流強化の印
"392D", //血気強化の印
"3A61", //雌伏強化の印
"3AFD", //喝強化の印
"3D97", //猛進強化の印
"4086" //幕無強化の印
]]
]);
SkillForm.setSeriesList([
["狩猟",["ブリゼGX","Ｔシャツ","オウビート|パピメル","ガーディアン,ヘルパー|ギルドガード,ヒーラー","ギルドナイト|メイド,プライベート","キングロブスタ","クロオビ","ジャージー","スカル","スティール","セフティ","チェーン","ネコピアス","ハイメタ","ハンター","バトル","ピアス","ビストロ","ベルト","ボーン","ホープ","マカルパ","マフモフ","メタル","メラン","メルホア","ルーキー","ルージュ","レザーライト","混沌","忍","SP"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1}),
	["モンスター",["アイルー","アカム","アクラ","アビオ","イーオス","エスピナ","エンプレス","カイザー","ガノス","ガブラス","ガルルガ","ガレオス","ギザミ","キリン","クアル","クシャ","クック","グラビド","グレン","ゲネポス","ゲリョス","ゴゴ","コンガ","ザザミ","ザムザ","タロス","ディアブロ","ドラゴン>ミラ","バサル","パリア","ヒプノ","ブランゴ","ブルファンゴ","フルフル","ベル","ミヅハ|トヨタマ","マグシア","モス","モノブロス","ラヴァ","ラヴィ","ラヴィ：狂","ランゴ","ランポス","ルコ","レイア","レウス","レックス","暁,曙|凛,艶","稲荷|玉藻","神楽|神座","金色|黒子","金剛|不動","夜叉|修羅"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["クエスト",["アーク","アスール","アスハルテ","アナキ","アプカル","アナトリ","アルル","イリーク>アフティ","ヴォル","カカブ","ククボ","コカロ","ゴスペル","ジェス","ジャガー","シャッセ","デスギア","ノワール","リオデュオ","ローク","鬼神|童子","夕焼|夕茜","黒虎|黒豹","刹帝利|婆羅門","超絶","Ｇ貢献証"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["謎クエスト",["アリエッタ>テンペスト","ヴィリヴラ>アングリフ","ヴェント>ミストラル","ジスト","ディジギア>>サルバシオン","プロギア>>ビステマ","ルクスト","ロイヤル>ロード","白蛇|白鳥"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["剛/天/覇",["ヴォン","アルゴル","アルテラ","ウィンド","ヴァル","エミット","オディバ","ガスラ","ガルバ","グァン","グレア","ストロマ","ディオレ","ディボア","トア","トリド","ハルド","フレイム","ブリッツ","フロル","ポボル","メラギ","リルス","ワダツミ|オカミ","武者|日光","雅孔|雅穿","浮峰|浮嶺"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["秘伝",["片手剣","双剣","大剣","太刀","ランス","ガンランス","ハンマー","狩猟笛","穿龍棍","ｽﾗｯｼｭｱｯｸｽ","ﾏｸﾞﾈｯﾄｽﾊﾟｲｸ","ライト","ヘビィ","弓"]],
	["Ｇ級",["エルゼＧ","ゼナＧ","キリンＧ","ルコＧ","アカムトＧ","アクラＧ","アビＧ","イーオスＧ","ヴァイスＧ","ヴォラＧ","ヴェノムＧ","エスピスＧ","エスピナＧ","エントラＧ","エンプレスＧ","カイザーＧ","ガノスＧ","ガノンＧ","ガルルガＧ","ガレオスＧ","ギザミＧ","クアルＧ","クックＧ","ククスＧ","クシャナＧ","グラビデＧ","グラビドＧ","グレンＧ","ゲネポスＧ","ゲリョスＧ","ゴゴＧ","コンガＧ","ザザミＧ","サベージＧ","ジェビアＧ","ショウロウＧ|ミタマＧ","ソルＧ","ディアースＧ","ディアブロＧ","ディスＧ","ドラギュＧ","ドラゴンＧ","トルペドＧ","バサルＧ","バルカンＧ","パリアＧ","ピエトラＧ","ヒプノＧ","ヒプックＧ","ヒプシーＧ","ファルノＧ","フランキーＧ","プランダＧ","ブランゴＧ","フルフルＧ","フルンＧ","ヘッジＧ","ベルＧ","ポカラＧ","ホープＧ","マグシアＧ","ミヅハＧ|トヨタマＧ","モノデビルＧ","モノブロスＧ","ラヴァＧ","ラヴィＧ：猛","ラヴィＧ：極","ランポスＧ","リオハートＧ","リオソウルＧ","レイアＧ","レウスＧ","レックスＧ","ルナＧ","レビＧ","稲荷Ｇ|玉藻Ｇ","神楽Ｇ|神座Ｇ","御神楽Ｇ|里神楽Ｇ","金色Ｇ|黒子Ｇ","黒影Ｇ|黒陰Ｇ","雅深Ｇ|雅淵Ｇ","創音奏Ｇ|音紡奏Ｇ","司銀Ｇ|操銀Ｇ","怒貌Ｇ|怒面Ｇ","照雷Ｇ|明雷Ｇ","弩岩Ｇ|紅岩Ｇ","帝征Ｇ|帝王Ｇ"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["狩衛戦",["アサーク","アブヤド","ゴルック","デゾルト","デリヴ","ハラガン","ブルック","レセーガ"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["天廊",["煉燭","煉獄","煉戟","クレオラ","煉緋Ｚ","煉華Ｚ","煉鳳Ｚ","祖龍GX","リュミエ","アンジュＧ","ウィル","ケイス","ニュイ","ニンファ","ハリメノ","ボニト","ミニオム","メイリダ","ライオス","ランヴォ","ロドクル","ワンス"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["遷悠",["シャガル","レギオス","荒天|蒼天","ゴア","ガンキン","ジンオウ","ナルガ","バンギス","ブラキ","ベリオ","獄狼"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["辿異",["ハルドＺ","ザムザＺ","グラビＺ","バルラＺ","ボガバドＺ","アノルＺ","イナガミＺ","ガスラＺ","ガノＺ","ギアＺ","トリドＺ","ドラギュＺ","ヒュジＺ","ミドＺ","ルコＺ","レックスＺ","ヴァシムＺ","レウスＺ","ブランゴＺ","エスピナＺ","ヒプノＺ","フルフルＺ","ザザミＺ"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})]
],
["猟団",["キリン頭","コサージュ","コムラド","コムラダＧ","シュッツ>>ツヴィンガ","ソルダート>ゲイブル","テネール","フェリ","ミクセス","ルディア>ルルディ","狩人","眼鏡","猟団員"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1}),
	["狩人祭",["ジンドルＧ","ビーターＧ","コレプトＧ","リンクスＧ","アルミュＧ","カシウスＧ","カリヴァＧ","チャトレＧ","リエブレＧ","リズヴェＧ","パシオ","ヴァクス","ノルック","ヴァリエ","エギエネ","アトラ","アネシス","ウィダ>スティーダ","ヴィネン","エクエス","オーロワ","オネロ","オリクト","オルケシス","オルドル","カバリバ","キニオル","クラージ","コンセルＧ","ザーカー|チェイサー","シカリ","ストレガ","チェニー","ディーナ","ディール","トルボダ","ニスル","ヒガクレ","プペン","ブレオ","ペルセ","マアデン","マダル","ヨルティ","ルデオス","ロウセスＧ","絶影|翔影","紅昇|紅楼","祭のあと"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["迎撃戦",["ミュンルＺ","ファンルＺ","シャンルＺ","歌紡","ウタンテＺ","フランテＺ","メレンテＺ","リカンテＺ","歌詠","焔嶽Ｇ|緋嶽Ｇ","カタンテＺ"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})]
],
["イベント",["シャンディ","バンケット","タルタ","グリディＺ","エリュシＧ","シフニィＺ","ラファンＧ","華燭Ｚ","アルガノ|ゴルガノ","潔燭Ｚ","フォンセＧ","ボンネＧ","コリニィＺ","ドゥンルGX","ヘルトＧ：イロアスＧ","鬼穿Ｇ|童穿Ｇ","ラーヴェ","マーブル","キュール","鬼凛Ｇ|童凛Ｇ","ロホック","あかねこ服","アスールＧ","アトロ","ウナペルト","エクセレ","オトノ","オレウム","カイオル","ガウシカ","ガネト","カライス","キノス系","キリンコルノ","クオイズ","グラッシュ","クラフト","クラント","コルーデ","しましま","シェルカ|チェスカ","シルック","ストレング","サンタ","シウスＧ","シエリー","ジェスＧ","スフォル","タングス|コバルタ","タングスＧ|コバルタＧ","チールＧ","チャチャ","チャーム系","ドグメア","トリート","ハーヴェスト>>コピアイ","ハイメタＵ","ハルバダー|トラッカー","バレッタ","ハロキュ","ピアス(ｲﾍﾞﾝﾄ)","ピアス(書物)","ピアス(海陸空)","ピアス(ビギナー)","ピアス(封印石)","フェイク","ブラン","フロガダＧ","モスカバ","ユーリス","ユプケ","ラース","ランセ","リアルオ","ルケーゼ","ルチャル","レイレスＧ","レウアスＧ","ロアース|ライード","蒼空|蒼天","納言|式部","鬼神|童子","鬼伝Ｇ|童伝Ｇ","若紅葉|翡戸隠","淡桜|桜雲","崩霧|迅霧"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1}),
	["韋駄天",["ぺたぺたグーク","タルネコ","タンドレス"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})]
],
["ネカフェ",["ルルタ","アデュス>デュスノ","アミティエ>ピスティス","エンブレイス","オルデン>オルテモ","カイラ","ガガチュ","キューラー","ジャンピン>ブリンク","スフレ","ソレーネ","デゼール","トイスト","トランス","トロピオ","マギサ>>ブルホ|ウィザー>>マーギア","ラピヌ","リエーザ>リサーザ","ルクス>ルキス","レギス>レギュクス","ワグネ"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1}),
	["イベント",["カフェピアス"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})]
],
["ガチャ",
	["アグリア>フラウア","ウーコン","エコール>ディアン","エス・クェラ>パンデウム","オービス","ガンズ>ワイルド","キュビィ","クリュス|クォート","ケモル","コンタオ","スタリナ","ゼーレ>シュナイト","ゼロイ","ティーア>ヴィルト","ディクト>ディレット","デュール","ハウクス","ファルコ","ヒプノルータ>ガルーダ","ヒプノリア>フィアラル","ピラータ","フォーヴ>フィアス","ニンバス","ミューズ>テューン","ミラド","ラトリア","リーデレ","リエット","ルース","ルターレ","レイル","ロット","ロバスト","流転|旋転","嵐転|地転","月陽","曙光"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1}),
	["剣士 [同性能は１枠にまとめ]",["アセルス：ウルバヌ","インジン：クレバン","ウーズィ：ヴェンガ","ヴァンデ：ヴェロシ","ヴィン：クルシッド","ヴェスナ：アレス","オール：フィーブル","カタフ：ミール","ゲレオン：ミッシナ","カリフ：ルルス","ゲレール：ビリス","クレネス：ファクト","ケック：プリース","ゴラエス：ジェアム","コンシラ：トレスパ","コンセト：ロサ","シデロ：パスマ","ジャッグ：シプレル","スイフド：シャッド","スィーニ：シュロス","スクラ：マグヌス","スディブ：アスティ","スマトス：タニイ","デスモ：ケプト","ノット：マシャル","バーク：ヴィリヤ","バシリス：アミュス","バステル：ハオス","バラバン：セリュー","ファキル：フラント","ファルム：ソレルス","フィブラ：アガトン","フェサー：カウント","フォルトゥ：ヴェルス","ブリガン：ラプラル","プレデタ：ステラル","フリゲト：マドニカ","フルイト：スケイナ","プロクス：フィデル","ベラノ：カリノ","メタロ：ヴァラク","メロデス：フュージ","リガス：ランプロ","レーラー：ギエール","レガーメ：スプリン","厳岩：フラート","不破：ナーレー","無想：ヘイツ"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["ガン [同性能は１枠にまとめ]",["アルジャ：ネウロン","グラース：アエトス","シアンス：フュルス","シター：ナーダ","スフェラ：ウェネス","ディゼル：パルフェ","デクスタ：メテロス","パッシオ：ミナム","プリジド：ハキュラ","ヘンフロ：レキトリ","ミーツェ：ソフィス","ミスク：ハウット","ラソス：ペンブル","ハネツァ：パス","プラム：サザール","俊激：レーング"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["ピアス",["エナ","ジオ","セケン","トリア"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["小判",["アリシャ","ジェムズ","了奏","リッカ","フィーネ","フィール","フィニス","コトナ","アンブ","キンコウ","レコリス","ロゥリィ","アリシス","ロクラス","ラビウス","アリシア","ファビラ","レニガン","ディンス","フィンス","デストラG","ロッカ","ペンレ","ザッカ","ランタナ","シャルフ","カマラ","ルーチェ","レビン","シュイ","アルフィ","カイファ","ストラザ","サイネ","ウイング","ピンビ","プリブ","シャルル","ディラン","ミリアム","カサミエ","ヘシュム","パンセ","ムルタ","ハウラ","マリジュ","サクフィ","アスモ","アイルー|メラルー","和奏","アーベン","ヴィーチ","サルタ","シエロ","シルティ","ズィベイ","セイラー","テリュオ","ハーゼ","ブロンテ","ベンディ","ルヴナン","和花","ケラヴノ","アウラ","クロフィ","チアリム"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["小判(大討伐)",["デストラG","アービターG"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["FP",["ギルドバード|スカラー","ユクモ","ロワーガ|ファルメル"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["コラボ",["ディスタ|イオニア","キリーク|クーナ","白銀の甲冑|薔薇の舞踏服","十二勇士甲冑|不貞隠しの兜","救国の聖女服|竜殺しの甲冑","グレイ|ウルピナ","ノエル|ビューネイ","ﾖﾙﾊ九号S型|ﾖﾙﾊ二号B型","ロックブーケ|アルカイザー","アデル|クローディア","ユキネ|雪ミク","雅","オルロジュ|ドルチェ","カイジ|美心","ラモール|リュバン","CEケブラー|ABレイヤー","プラグ","初号機|零号機","Ｍark.０６|２号機","リュウ|ニーナ"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["秘伝",["片手剣","双剣","大剣","太刀","ランス","ガンランス","ハンマー","狩猟笛","穿龍棍","ｽﾗｯｼｭｱｯｸｽ","ﾏｸﾞﾈｯﾄｽﾊﾟｲｸ","ライト","ヘビィ","弓"]]
],
["キット",["地ノ崩砲","夜ノ弓聖","宵ノ告槍","桜ノ歌笛","白ノ穿光","空ノ砕槍","紅ノ双星","茜ノ春刀","菊ノ乱鎚","蒼ノ剣雄","藤ノ彩斧","陽ノ砲銃","黒ノ天剣","ワンダレ","ペレグリ","グーダン","IS学園","アステリ","リアン","キャロル","ミク","赤原礼装,騎士王","英雄王,ゴルゴン","シャラン","ブレイズ","ランページ","レイジ","エスピマスク","アオノコ","マンドラ","プーギー","ガウス","ウェーバ","ギルバート","ブライト","ジュアリ","ティンク","オナブル","シャテム","ヘヴリア","ティルル","ディナト","ドゥケ","グラヌ","千代","蒼皇氷","白皇氷","紅皇氷","エヴォル"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1}),
	["旧",["アージェ","アビット","アルマ","アリスト","イクス","エディオ","オメット","カーマイン|サジタリオ","カウチュ","カエシス","カマレラ","ガリトス","きんねこ服","ぎんねこ服","クレール","クロース","グロリア","ゲノム","ゲルト","ゴルト","シエナ","シェリフ","しろねこ服","ステノ","スリート","セレナ","ゾデック","ダスク","ダンテ,レディ","ディヴォル","テクスト","デモン,シャドウ|カオス,ソウル","トラス","ナーガ","ネコダン","ノワールヘッド","バーニー","ピクス","ファラン","フェルム","プロミス>ブリス","星祭|七夕","ホワイトメタル>>シエル","マイスト","マゴス","マギサ|ウィザー","マリン","メテネラ","メレティ","リブリー","リゲリア","ルフレ","レアル","レイスト","昇龍,百裂|波動,気功","竜巻,千裂|真空,覇山","神龍,キャノン|裂破,アクセル","蘭陀|蘭蛮","一閃,蜂針|構射,気弾","蒼竜ノ具足|蒼竜ノ羽織","赤備ノ具足|赤備ノ羽織","調査兵団,訓練兵団","天日","オユン"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
],
["パッケージ",["アッシュ","アミスタ","ガニア","戯曲","ザイラ","セクティ","バンデ","ペリフ","ラフねこ服","レグヌム","飛天"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1}),
	["PS3/4/WiiU",["メトリー：アミロ"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})]
],
["特典",["エミール","アメザリ","ヴェラン","エアリアル","エクスト","キャリッジ","くろねこ服","グリンデ","クロッス","ゴシック>ベイル","スマート","スフィア","ソルフレア","デュオ系","テリオグ","トゥールム","ノメル","ハセルヴォルフット","ヒストリア","ブートアップ","ファミ通Ｔシャツ","フィディ>>ヴェルフ","ぺたぺたグーク","ムース","ライダー>ライジング","ランデグ","ルワージュ","ロジウェア","ユウェネス","旋風,天空|巴,天昇","正拳,龍星|灼熱,虎襲","抜胴,長根|花火,流星","雷刃,天星|迅雷,飛燕","歌姫ＤＩＶＡピアス"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1}),
	["HL",["ケリス","エリス","ディオス","レグラ","カリス"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["EX",["アイルーのネコミミ","エクストラ","ケルビフェイク","チューヨ","フェロウ"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})],
	["PS3/WiiU",["ノヴィー：リグイ","聖王,英雄王"].sort(function (a, b){return Fulltohalf(b) < Fulltohalf(a) ? 1 : -1})]
]
]);
SkillForm.setSeries = function (_id,_mei) {
	if (_mei === "-") return "";
	var mei = _mei.replace(/Ｇ/g,"").replace(/Ｚ/g,"").replace(/GX/g,"");
	var series = {C:"9",low_hr:0,high_hr:0,F1:[mei],F2:[],S:"",R:[]};
	switch (_id.charAt(0)) {
	case "0": //狩猟
		series.C = "1-#2m#1c#";
		switch (_id.substring(1)) {
		case "2": //モンスター
			series.high_hr = 1999;	//HRまで
			break;
		case "5": //剛種
			series.R = ["Ｚ","ZY","ZF","ZX"];
			break;
		case "7": //Ｇ級
			series.low_hr = 2001;	//GRから
			series.R = ["Ｚ","ZY","ZF","ZX"];
			break;
		case "8": //狩衛戦
			series.C = "1s#";
			break;
		case "9": //天廊
			series.C = "1t#";
			break;
		case "11": //辿異
			series.low_hr = 2200;	//GRから
			series.high_hr = 3000;	//GSRまで
			break;
		}
		break;
	case "1": //猟団
		series.C = "2-#2m#2u#";
		break;
	case "2": //イベント
		series.C = "1e#1i#";
		break;
	case "3": //ネカフェ
		series.C = "3-#3e#";
		break;
	case "4": //ガチャ
		series.C = "4g#";
		break;
	case "5": //キット
		series.C = "4k$";
		break;
	case "6": //パッケージ
		series.C = "5p#";
		break;
	case "7": //特典
		series.C = "5-#";
		break;
	}
	switch (mei) {
	case "ベルト":
		series.F1 = ["アイアン","スキンライト","ハイド"];
		break;
	case "チェーン":
		series.F1 = ["チェーン","Ｃ・"];
		break;
	case "ランポス":
		series.F1 = ["ランポス","ギアノス"];
		break;
	case "レイア":
		if (_id.charAt(1) !== "7") series.F1 = ["レイア","リオハート","ゴールドルナ","Ｇ・ルナ"];
		break;
	case "レウス":
		if (_id.charAt(1) !== "7") series.F1 = ["レウス","リオソウル","シルバーソル","Ｓ・ソル"];
		break;
	case "キングロブスタ":
		series.F1 = ["キングロブスタ","Ｋ・"];
		break;
	case "ピアス(ｲﾍﾞﾝﾄ)":
		series.F1 = ["トリビュートピアス"];
		break;
	case "ピアス(書物)":
		series.F1 = ["衝撃のピアス","射手のピアス","先見のピアス","捨身のピアス","慈愛のピアス"];
		break;
	case "ピアス(海陸空)":
		series.F1 = ["マーレピアス","海洋のピアス","スカイピアス","天空のピアス","ランドピアス","大地のピアス"];
		break;
	case "ピアス(ビギナー)":
		series.F1 = ["ルーフスピアス","シーニーピアス","ジョーヌピアス","アルブスピアス","プレートピアス"];
		break;
	case "ピアス(封印石)":
		series.F1 = ["ソウイル","アンサズ","エオロー","ラグズ","ゲーボ","テイワズ","ウルズ","エイワズ"];
		break;
	case "カフェピアス":
		series.F1 = [];
		series.C = "3e#";
		series.S = "ピアス";
		break;
	case "ピアス":
		series.F1 = ["レッドピアス","ブルーピアス","ブラックピアス","ホワイトピアス","セフティ"];
		break;
	case "ネコピアス":
		series.F1 = [];
		series.S = "ネコ";
		break;
	case "フェイク":
		series.F1 = [];
		series.S = mei;
		series.R = ["チャチャ"];
		break;
	case "バレッタ":
	case "コサージュ":
	case "メタル":
	case "Ｔシャツ":
	case "ジャージー":
	case "眼鏡":
		series.F1 = [];
		series.S = mei;
		break;
	case "SP":
		series.F1 = [];
		series.S = mei;
		series.C = "9";
		break;
	case "モノブロス":
		series.F1 = ["モノブロ","モノデビル"];
		if (_mei === "モノブロスＧ") series.R = ["モノデビル"];
		break;
	case "ドラゴン>ミラ":
		series.F1 = ["ドラゴン","ミラバルカン","ミラルーツ"];
		break;
	case "コムラド":
		series.F1 = ["コムラド","コムラダ"];
		series.high_hr = 1999;
		break;
	case "コムラダ":
		series.low_hr = 2001;
		break;
	case "ホワイトメタル>>シエル":
		series.F1 = ["ホワイトメタル","セレスト","シエル"];
		break;
	case "プロギア>>ビステマ":
		series.F1 = ["プロギア","オラシオン","レクイエム","ビステマ"];
		break;
	case "デュオ系":
		series.F1 = ["デュオ","クアッド","Ｃｏｒｅ"];
		break;
	case "エクスト":
		series.R = ["エクストラ"];
		break;
	case "マギサ|ウィザー":
		series.F1 = ["マギサ","クロウリー","ウィザー","ファウスト"];
		break;
	case "マギサ>>ブルホ|ウィザー>>マーギア":
		series.F1 = ["マギサ","クロウリー","ブルホ","ウィザー","ファウスト","マーギア"];
		break;
	case "ディジギア>>サルバシオン":
		series.F1 = ["ディジギア","プリエール","サルバシオン"];
		break;
	case "ガーディアン,ヘルパー|ギルドガード,ヒーラー":
		series.F1 = ["ガーディアン","ヘルパー","ヒーラー","ギルドガード","Ｇ・ガード"];
		break;
	case "キノス系":
		series.F1 = ["キノス","ヒメロス","ブレシス","カリエン"];
		break;
	case "キリン頭":
		series.F1 = ["キリンベルデ","キリンルフス","キリンアピリ"];
		break;
	case "エスピナ":
		series.F1 = ["エスピナ","ヴァイス"];
		break;
	case "シュッツ>>ツヴィンガ":
		series.F1 = ["シュッツ","ヒルフェ","ツヴィンガ"];
		break;
	case "エスピマスク":
		series.F1 = ["エスピ"];
		series.F2 = ["マスク"];
		break;
	case "ハイメタＵ":
		series.F1 = ["ハイメタＵヘルム・","ハイメタＲヘルム・"];
		break;
	case "ブートアップ":
		series.F1 = ["ブートアップ","ブートＦ"];
		break;
	case "フィディ>>ヴェルフ":
		series.F1 = ["フィディ","エピディ","ヴェルフィ","ヴェルフ"];
		break;
	case "ハーヴェスト>>コピアイ":
		series.F1 = ["ハーヴェスト","フレイ","クロノス","レアー","ハーデス","コルヌー","コピアイ"];
		series.R = ["フレイム"];
		break;
	case "チャーム系":
		series.F1 = [];
		series.S = "チャーム";
		break;
	case "ショウロウ|ミタマ":
		series.F1 = ["ショウロウ","ミタマ","シャンテ"];
		break;
	case "ディアブロ":
		series.F1 = ["ディアブロ","ディア"];
		if (_mei === "ディアブロＧ") series.R = ["ディアー"];
		break;
	case "片手剣":
		series.F1 = ["リリオ","ガーネット","ルベライト"];
		series.S = "剣聖";
		break;
	case "双剣":
		series.F1 = ["フレサ","アメジスト","ラズライト"];
		series.S = "双龍";
		break;
	case "大剣":
		series.F1 = ["クラベル","コーラル","ジルコン"];
		series.S = "剣王";
		break;
	case "太刀":
		series.F1 = ["シルエラ","クォーツ","スピネル"];
		series.S = "刀神";
		break;
	case "ランス":
		series.F1 = ["セレソ","ルビー","パイローブ"];
		series.S = "天槍";
		break;
	case "ガンランス":
		series.F1 = ["オリバ","サファイア","アイオラ"];
		series.S = "砲皇";
		break;
	case "ハンマー":
		series.F1 = ["カメリア","エメラルド","ジェイド"];
		series.S = "鈍器獣";
		break;
	case "狩猟笛":
		series.F1 = ["ハシント","パール","アゲート"];
		series.S = "奏帝";
		break;
	case "穿龍棍":
		series.F1 = ["ヒスイ","ブラッド"];
		series.S = "穿凰";
		break;
	case "ライト":
		series.F1 = ["ラウレル","トパーズ","シトリン"];
		series.S = "銃傑";
		break;
	case "ヘビィ":
		series.F1 = ["ココ","トルマリン","ペリドット"];
		series.S = "銃仙";
		break;
	case "弓":
		series.F1 = ["グラナダ","ラピス","ターコイズ"];
		series.S = "弓鬼";
		break;
	case "ｽﾗｯｼｭｱｯｸｽ":
		series.F1 = ["オニキス","ルチル"];
		series.S = "斬将";
		break;
	case "ﾏｸﾞﾈｯﾄｽﾊﾟｲｸ":
		series.F1 = ["タンザナ","ヘマタイト"];
		series.S = "磁星";
		break;
	case "貢献証":
		series.F1 = ["コントラ","ジントラ","アントラ","ビントラ","タントラ"];
		break;
	case "調査兵団,訓練兵団":
		series.F1 = ["調査兵団","訓練兵団","立体機動装置"];
		break;
	case "フランキー":
		series.F1 = ["フラン"];
		break;
	case "タングス|コバルタ":
		series.F1 = mei.split(/[|,]/);
		if (_mei === "タングスＧ|コバルタＧ") {
			series.low_hr = 2001;
		} else {
			series.high_hr = 1999;
		}
		break;
	case "エンプレス":
		series.F1 = ["エンプレス","エンプレ"];
		break;
	case "リオハート":
		series.F1 = ["リオハート","ハート"];
		break;
	case "リオソウル":
		series.F1 = ["リオソウル","ソウル"];
		break;
	case "ディアース":
		series.F1 = ["ディアース","アース"];
		break;
	case "モノデビル":
		series.F1 = ["モノデビル","モノデビ"];
		break;
	case "ヒプシー":
		series.F1 = ["ヒプシー","ヒプシ"];
		break;
	case "ラヴィ":
		series.high_hr = 0;
		series.R = ["狂","猛","極"];
		break;
	case "ラヴィ：狂":
		series.high_hr = 0;
		series.F1 = ["ラヴィ狂"];
		series.S = "：狂";
		break;
	case "ラヴィ：猛":
		series.F1 = ["ラヴィ猛"];
		series.S = "：猛";
		break;
	case "ラヴィ：極":
		series.F1 = ["ラヴィＧ極"];
		series.S = "：極";
		break;
	case "カバリバ":
		series.F1 = ["カバリバ","カバリ"];
		break;
	case "トルボダ":
		series.F1 = ["トルボダ","トルボ"];
		break;
	case "アイルー|メラルー":
		series.F1 = ["アイルー","メラルー","アメショ","チャトラ","ミケ","シロ","チャシロ","クロシロ"];
		break;
	default:
		if (mei.indexOf("：") !== -1) {
			series.F1 = mei.split("：");
		} else if (mei.indexOf("|") !== -1) {
			series.F1 = mei.split(/[|,]/);
		} else if (mei.indexOf(",") !== -1) {
			series.F1 = mei.split(",");
		} else if (mei.indexOf(">") !== -1) {
			series.F1 = mei.split(">");
		}

		break;
	}

	return series;
}
})();
